
transformation using min-max normalization, z-score normalization and decimal scaling operation.

In [57]:
import pandas as pd
import numpy as np

In [58]:
df = pd.read_csv("Dataset2.csv")
df.head()

   id     name         DOB gender  salary
0   1    Umang  11/22/1999      f  200000
1   2    Harsh   1/23/1998      f   10000
2   3  Dhruvil  12/27/1995      m   10000
3   4  Harshil    2/2/2000      m   25000
4   5    Sahil   3/15/2001      m    4000

In [59]:
df.shape

(100, 5)

In [60]:
val = df['salary']
min_val = min(val)
max_val = max(val)
new_min = 0
new_max = 1
print("Max_val {} and Min _Value {} ".format(max_val,min_val))

Max_val 780000 and Min _Value 4000

### Min-Max Normalization

In [61]:
#formula : - new_val = (((val-min_val)/(max_val-min_val))*(new_max-new_min)) + new_min
for i in val:
    new_val = (((val-min_val)/(max_val-min_val))*(new_max-new_min)) + new_min

In [62]:
df['min_max_nor_sal'] = new_val

In [63]:
df.head()

   id     name         DOB gender  salary  min_max_nor_sal
0   1    Umang  11/22/1999      f  200000         0.252577
1   2    Harsh   1/23/1998      f   10000         0.007732
2   3  Dhruvil  12/27/1995      m   10000         0.007732
3   4  Harshil    2/2/2000      m   25000         0.027062
4   5    Sahil   3/15/2001      m    4000         0.000000

### Decimal Scaling

In [64]:
print(max_val)
length = len(str(max_val))
print(length)
denominator = pow(10,length)

780000
6

In [65]:
for i in val:
    new_decimal_val = (val/denominator)

In [66]:
df['decimal_scaling_sal'] = new_decimal_val

### Z-score Normalization

In [67]:
mean_val = np.mean(val)
std_dev = np.std(val)
var_val = np.var(val)

In [68]:
for i in val:
    new_z_score_val = (val-mean_val)/std_dev

In [69]:
df['z_score_sal'] = new_z_score_val

In [70]:
df.head()

,id,name,DOB,gender,salary,min_max_nor_sal,decimal_scaling_sal,z_score_sal
0,1,Umang,11/22/1999,f,200000,0.252577,0.200,0.324804
1,2,Harsh,1/23/1998,f,10000,0.007732,0.010,-0.634840
2,3,Dhruvil,12/27/1995,m,10000,0.007732,0.010,-0.634840
3,4,Harshil,2/2/2000,m,25000,0.027062,0.025,-0.559078
4,5,Sahil,3/15/2001,m,4000,0.000000,0.004,-0.665144